# tap "d12frosted/emacs-plus"
brew "chezmoi"
brew "fish"
brew "age"
brew "age-plugin-se"
brew "sops"
brew "duck"
brew "mas"
brew "r"
brew "uv"
brew "sqlite"
brew "rust"
brew "coreutils"
brew "curl"
brew "poppler"
brew "git"
brew "neovim"
brew "jq"
brew "node"
brew "deno"
brew "rbw"
brew "ocrmypdf"
brew "pandoc"
brew "ripgrep"
brew "tesseract"
brew "tesseract-lang"
brew "tmux"
brew "typst"
brew "wget"
brew "cmake"
# brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-elrumo2-icon"]
cask "actual"
cask "adobe-acrobat-reader"
cask "db-browser-for-sqlite"
cask "docker-desktop"
cask "figma"
cask "affinity"
cask "firefox"
cask "ghostty"
cask "gimp"
cask "karabiner-elements"
cask "logi-options+"
cask "element"
cask "nextcloud"
cask "raycast"
cask "portfolioperformance"
cask "presentation"
cask "raspberry-pi-imager"
cask "rstudio"
cask "signal"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "quarto"
cask "zoom"
cask "zettlr"
cask "mactex-no-gui"
cask "zotero"
cask "languagetool-desktop"
cask "font-juliamono"
cask "font-noto-sans"
cask "font-maple-mono-nf"
cask "thingsmacsandboxhelper"
mas "addy.io", id: 6670220050
mas "Aiko", id: 1672085276
mas "Bitwarden", id: 1352778147
mas "eduVPN", id: 1317704208
mas "Mela", id: 1568924476
mas "Postico", id: 6446933691
mas "Reeder", id: 6475002485
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "TextCompare", id: 6502242357
mas "Things", id: 904280696
mas "VMware Remote Console", id: 1230249825
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.vscode-fish"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "esbenp.prettier-vscode"
vscode "mcanouil.quarto-wizard"
vscode "foxundermoon.shell-format"
vscode "mads-hartmann.bash-ide-vscode"
vscode "malmaud.tmux"
vscode "mblode.zotero"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "posit.air-vscode"
vscode "quarto.quarto"
vscode "rangav.vscode-thunder-client"
vscode "rdebugger.r-debugger"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "rszyma.vscode-kanata"
vscode "sabaken.seti-minimal-folder"
vscode "sainnhe.edge"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tootone.org-mode"
vscode "tombi-toml.tombi"
vscode "alexhammans.pandoc-grid-table"
vscode "TakumiI.markdowntable"
vscode "nhoizey.gremlins"
vscode "samuelcolvin.jinjahtml"
